//定义城市数据数组
city = new Array();
city[1] = new Array("北京市", "1|东城区|2|西城区|3|崇文区|4|宣武区|5|朝阳区|6|丰台区|7|石景山区|8|海淀区|9|门头沟区|10|房山区|11|通州区|12|顺义区|13|昌平区|14|大兴区|15|怀柔区|16|平谷区|17|密云县|18|延庆县");
city[2] = new Array("上海市", "19|黄浦区|20|卢湾区|21|徐汇区|22|长宁区|23|静安区|24|普陀区|25|闸北区|26|虹口区|27|杨浦区|28|闵行区|29|宝山区|30|嘉定区|31|浦东新区|32|金山区|33|松江区|34|青浦区|35|南汇区|36|奉贤区|37|崇明县");
city[3] = new Array("天津市", "38|和平区|39|河东区|40|河西区|41|南开区|42|河北区|43|红桥区|44|塘沽区|45|汉沽区|46|大港区|47|东丽区|48|西青区|49|津南区|50|北辰区|51|武清区|52|宝坻区|53|宁河县|54|静海县|55|蓟县");
city[4] = new Array("重庆市", "56|万州区|57|涪陵区|58|渝中区|59|大渡口区|60|江北区|61|沙坪坝区|62|九龙坡区|63|南岸区|64|北碚区|65|万盛区|66|双桥区|67|渝北区|68|巴南区|69|黔江区|70|长寿区|71|江津区|72|合川区|73|永川区|74|南川区|75|綦江县|76|潼南县|77|铜梁县|78|大足县|79|荣昌县|80|璧山县|81|梁平县|82|城口县|83|丰都县|84|垫江县|85|武隆县|86|忠县|87|开县|88|云阳县|89|奉节县|90|巫山县|91|巫溪县|92|石柱土家族自治县|93|秀山土家族苗族自治县|94|酉阳土家族苗族自治县|95|彭水苗族土家族自治县");
city[5] = new Array("黑龙江省", "96|哈尔滨市|97|齐齐哈尔市|98|鸡西市|99|鹤岗市|100|双鸭山市|101|大庆市|102|伊春市|103|佳木斯市|104|七台河市|105|牡丹江市|106|黑河市|107|绥化市|108|大兴安岭地区");
city[6] = new Array("吉林省", "109|长春市|110|吉林市|111|四平市|112|辽源市|113|通化市|114|白山市|115|松原市|116|白城市|117|延边朝鲜族自治州");
city[7] = new Array("辽宁省", "118|沈阳市|119|大连市|120|鞍山市|121|抚顺市|122|本溪市|123|丹东市|124|锦州市|125|营口市|126|阜新市|127|辽阳市|128|盘锦市|129|铁岭市|130|朝阳市|131|葫芦岛市");
city[8] = new Array("山东省", "132|济南市|133|青岛市|134|淄博市|135|枣庄市|136|东营市|137|烟台市|138|潍坊市|139|济宁市|140|泰安市|141|威海市|142|日照市|143|莱芜市|144|临沂市|145|德州市|146|聊城市|147|滨州市|148|菏泽市");
city[9] = new Array("山西省", "149|太原市|150|大同市|151|阳泉市|152|长治市|153|晋城市|154|朔州市|155|晋中市|156|运城市|157|忻州市|158|临汾市|159|吕梁市");
city[10] = new Array("陕西省", "160|西安市|161|铜川市|162|宝鸡市|163|咸阳市|164|渭南市|165|延安市|166|汉中市|167|榆林市|168|安康市|169|商洛市");
city[11] = new Array("河北省", "170|石家庄市|171|唐山市|172|秦皇岛市|173|邯郸市|174|邢台市|175|保定市|176|张家口市|177|承德市|178|沧州市|179|廊坊市|180|衡水市");
city[12] = new Array("河南省", "181|郑州市|182|开封市|183|洛阳市|184|平顶山市|185|安阳市|186|鹤壁市|187|新乡市|188|焦作市|189|济源市|190|濮阳市|191|许昌市|192|漯河市|193|三门峡市|194|南阳市|195|商丘市|196|信阳市|197|周口市|198|驻马店市");
city[13] = new Array("湖北省", "199|武汉市|200|黄石市|201|十堰市|202|宜昌市|203|襄樊市|204|鄂州市|205|荆门市|206|孝感市|207|荆州市|208|黄冈市|209|咸宁市|210|随州市|211|恩施土家族苗族自治州|212|仙桃市|213|潜江市|214|天门市|215|神农架林区");
city[14] = new Array("湖南省", "216|长沙市|217|株洲市|218|湘潭市|219|衡阳市|220|邵阳市|221|岳阳市|222|常德市|223|张家界市|224|益阳市|225|郴州市|226|永州市|227|怀化市|228|娄底市|229|湘西土家族苗族自治州");
city[15] = new Array("海南省", "230|海口市|231|三亚市|232|五指山市|233|琼海市|234|儋州市|235|文昌市|236|万宁市|237|东方市|238|定安县|239|屯昌县|240|澄迈县|241|临高县|242|白沙黎族自治县|243|昌江黎族自治县|244|乐东黎族自治县|245|陵水黎族自治县|246|保亭黎族苗族自治县|247|琼中黎族苗族自治县");
city[16] = new Array("江苏省", "248|南京市|249|无锡市|250|徐州市|251|常州市|252|苏州市|253|南通市|254|连云港市|255|淮安市|256|盐城市|257|扬州市|258|镇江市|259|泰州市|260|宿迁市");
city[17] = new Array("江西省", "261|南昌市|262|景德镇市|263|萍乡市|264|九江市|265|新余市|266|鹰潭市|267|赣州市|268|吉安市|269|宜春市|270|抚州市|271|上饶市");
city[18] = new Array("广东省", "272|广州市|273|韶关市|274|深圳市|275|珠海市|276|汕头市|277|佛山市|278|江门市|279|湛江市|280|茂名市|281|肇庆市|282|惠州市|283|梅州市|284|汕尾市|285|河源市|286|阳江市|287|清远市|288|东莞市|289|中山市|290|潮州市|291|揭阳市|292|云浮市");
city[19] = new Array("广西省", "293|南宁市|294|柳州市|295|桂林市|296|梧州市|297|北海市|298|防城港市|299|钦州市|300|贵港市|301|玉林市|302|百色市|303|贺州市|304|河池市|305|来宾市|306|崇左市");
city[20] = new Array("云南省", "307|昆明市|308|曲靖市|309|玉溪市|310|保山市|311|昭通市|312|丽江市|313|思茅市|314|临沧市|315|楚雄彝族自治州|316|红河哈尼族彝族自治州|317|文山壮族苗族自治州|318|西双版纳傣族自治州|319|大理白族自治州|320|德宏傣族景颇族自治州|321|怒江傈僳族自治州|322|迪庆藏族自治州");
city[21] = new Array("贵州省", "323|贵阳市|324|六盘水市|325|遵义市|326|安顺市|327|铜仁地区|328|黔西南布依族苗族自治州|329|毕节地区|330|黔东南苗族侗族自治州|331|黔南布依族苗族自治州");
city[22] = new Array("四川省", "332|成都市|333|自贡市|334|攀枝花市|335|泸州市|336|德阳市|337|绵阳市|338|广元市|339|遂宁市|340|内江市|341|乐山市|342|南充市|343|眉山市|344|宜宾市|345|广安市|346|达州市|347|雅安市|348|巴中市|349|资阳市|350|阿坝藏族羌族自治州|351|甘孜藏族自治州|352|凉山彝族自治州");
city[23] = new Array("内蒙古自治区", "353|呼和浩特市|354|包头市|355|乌海市|356|赤峰市|357|通辽市|358|鄂尔多斯市|359|呼伦贝尔市|360|巴彦淖尔市|361|乌兰察布市|362|兴安盟|363|锡林郭勒盟|364|阿拉善盟");
city[24] = new Array("宁夏回族自治区", "365|银川市|366|石嘴山市|367|吴忠市|368|固原市|369|中卫市");
city[25] = new Array("甘肃省", "370|兰州市|371|嘉峪关市|372|金昌市|373|白银市|374|天水市|375|武威市|376|张掖市|377|平凉市|378|酒泉市|379|庆阳市|380|定西市|381|陇南市|382|临夏回族自治州|383|甘南藏族自治州");
city[26] = new Array("青海省", "384|西宁市|385|海东地区|386|海北藏族自治州|387|黄南藏族自治州|388|海南藏族自治州|389|果洛藏族自治州|390|玉树藏族自治州|391|海西蒙古族藏族自治州");
city[27] = new Array("西藏自治区", "392|拉萨市|393|昌都地区|394|山南地区|395|日喀则地区|396|那曲地区|397|阿里地区|398|林芝地区");
city[28] = new Array("新疆自治区", "399|乌鲁木齐市|400|克拉玛依市|401|吐鲁番地区|402|哈密地区|403|昌吉回族自治州|404|博尔塔拉蒙古自治州|405|巴音郭楞蒙古自治州|406|阿克苏地区|407|克孜勒苏柯尔克孜自治州|408|喀什地区|409|和田地区|410|伊犁哈萨克自治州|411|塔城地区|412|阿勒泰地区|413|石河子市|414|阿拉尔市|415|图木舒克市|416|五家渠市");
city[29] = new Array("安徽省", "417|合肥市|418|芜湖市|419|蚌埠市|420|淮南市|421|马鞍山市|422|淮北市|423|铜陵市|424|安庆市|425|黄山市|426|滁州市|427|阜阳市|428|宿州市|429|巢湖市|430|六安市|431|亳州市|432|池州市|433|宣城市");
city[30] = new Array("浙江省", "434|杭州市|435|宁波市|436|温州市|437|嘉兴市|438|湖州市|439|绍兴市|440|金华市|441|衢州市|442|舟山市|443|台州市|444|丽水市");
city[31] = new Array("福建省", "445|福州市|446|厦门市|447|莆田市|448|三明市|449|泉州市|450|漳州市|451|南平市|452|龙岩市|453|宁德市");
city[32] = new Array("台湾省", "454|台北市|455|高雄市|456|基隆市|457|台中市|458|台南市|459|新竹市|460|嘉义市");
city[33] = new Array("香港", "461|中西区|462|湾仔区|463|东区|464|南区|465|油尖旺区|466|深水埗区|467|九龙城区|468|黄大仙区|469|观塘区|470|荃湾区|471|葵青区|472|沙田区|473|西贡区|474|大埔区|475|北区|476|元朗区|477|屯门区|478|离岛区");
city[34] = new Array("澳门", "479|澳门");


function updateCity()
{
  var provinceNode = document.all.selProvince;
  var cityNode = document.all.selCity;
  //当前所选择的省
  var provinceId = provinceNode.options[provinceNode.selectedIndex].value;
  //清空城市下拉选单
  document.all.selCity.length = 0;
  //得到当前省所辖制的地市
  cityArray = city[provinceId][1].split("|");
  var j;
  for (j = 0; j < cityArray.length; j += 2)
  {
    //填充城市下拉选单
    cityNode.options[cityNode.length] = new Option(cityArray[j + 1], cityArray[j]);
  }
}